Modul 7/app/Controllers/BukuController.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $data['buku'] = $this->bukuModel->findAll();

INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`, `created_at`, `updated_at`) VALUES ('Poor Folk', 'Fyodor Dostoevsky', 'Penguin Classics', '1846', '2026-06-08 21:09:26', '2026-06-08 21:09:26')
---
                );
    }

    $this->bukuModel->save([

        'judul' => $this->request->getPost('judul'),

        'penulis' => $this->request->getPost('penulis'),

        'penerbit' => $this->request->getPost('penerbit'),

        'tahun_terbit' => $this->request->getPost('tahun_terbit')
    ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '2'
---
    public function edit($id)
    {
        $data['buku'] = $this->bukuModel->find($id);

UPDATE `buku` SET `judul` = '100 Cara Mendapatkan NIlai Praktikum 100', `penulis` = 'Syahdamaaa', `penerbit` = 'Suka Suka Bit', `tahun_terbit` = '2023', `updated_at` = '2026-06-08 20:35:33'
WHERE `buku`.`id` IN ('2')
---
    public function update($id)
    {
    $rules = [

        'judul' => 'required',

        'penulis' => 'required',

        'penerbit' => 'required',

        'tahun_terbit' =>
            'required|integer|greater_than[1799]|less_than_equal_to[2025]'
    ];

    if (!$this->validate($rules))
    {
        return redirect()
                ->back()
                ->withInput()
                ->with(
                    'errors',
                    $this->validator->getErrors()
                );
    }

    $this->bukuModel->update($id, [

        'judul' => $this->request->getPost('judul'),

        'penulis' => $this->request->getPost('penulis'),

        'penerbit' => $this->request->getPost('penerbit'),

        'tahun_terbit' => $this->request->getPost('tahun_terbit')
    ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '2'
DELETE FROM `buku`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $buku = $this->bukuModel->find($id);

        if (!$buku)
        {
            return redirect()
                    ->to('/buku')
                    ->with(
                        'error',
                        'Data buku tidak ditemukan'
                    );
        }

        $this->bukuModel->delete($id);